sample/ERR_6(1019)_REQUEST.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:smev="http://smev.gosuslugi.ru/rev120315" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:mes="http://socit.ru/message" xmlns:soc="http://socit.ru">
   <soap:Body wsu:Id="body">
      <mes:SocPaymentsTumenRequest>
         <smev:Message>
            <smev:Sender>
               <smev:Code>159001661</smev:Code>
               <smev:Name>Автоматизированнная система Адресная социальная помощь</smev:Name>
            </smev:Sender>
            <smev:Recipient>
               <smev:Code>159001661</smev:Code>
               <smev:Name>Автоматизированнная система Адресная социальная помощь</smev:Name>
            </smev:Recipient>
            <smev:Originator>
               <smev:Code>159001661</smev:Code>
               <smev:Name>Автоматизированнная система Адресная социальная помощь</smev:Name>
            </smev:Originator>
            <smev:ServiceName>TestMnemonic</smev:ServiceName>
            <smev:TypeCode>GSRV</smev:TypeCode>
            <smev:Status>REQUEST</smev:Status>
            <smev:Date>2018-06-05T10:43:39+03:00</smev:Date>
            <smev:ExchangeType>2</smev:ExchangeType>
            <smev:TestMsg>Test</smev:TestMsg>
            <smev:OKTMO>71000000</smev:OKTMO>
         </smev:Message>
         <smev:MessageData>
            <smev:AppData>
               <soc:Request>
	              <soc:FamilyName>Тестов</soc:FamilyName>
                  <soc:FirstName></soc:FirstName>
                  <soc:Patronymic>ЕстьВыплата</soc:Patronymic>
                  <soc:BirthDate>1970-10-19</soc:BirthDate>
                  <soc:Snils>678-678-876 19</soc:Snils>
               </soc:Request>
            </smev:AppData>
         </smev:MessageData>
      </mes:SocPaymentsTumenRequest>
   </soap:Body>
</soap:Envelope>
